import { IStack } from "@/types/types";

export const stacker: IStack[] = [
  {
    id: 1,
    img: "/react.svg",
    name: "React JS",
    desc: "это библиотека для языка программирования JavaScript с открытым исходным кодом для разработки пользовательских интерфейсов. Она помогает быстро и легко реализовать реактивность — явление, когда в ответ на изменение одного элемента меняется все остальное.",
  },
  {
    id: 2,
    img: "/redux.svg",
    name: "Redux JS",
    desc: " библиотека для JavaScript с открытым исходным кодом, предназначенная для управления состоянием приложения. Чаще всего используется в связке с React или Angular для разработки клиентской части. Содержит ряд инструментов, позволяющих значительно упростить передачу данных хранилища через контекст",
  },
  {
    id: 3,
    img: "/sass.svg",
    name: "Sass",
    desc: "метаязык на основе CSS, предназначенный для увеличения уровня абстракции CSS-кода и упрощения файлов каскадных таблиц стилей. Включён в состав языка разметки Haml. Имеет два синтаксиса: sass — отличается отсутствием фигурных скобок, в нём вложенные элементы реализованы с помощью отступов",
  },
  {
    id: 4,
    img: "/typescript.svg",
    name: "TypeScript",
    desc: " язык программирования, представленный Microsoft в 2012 году и позиционируемый как средство разработки веб-приложений, расширяющее возможности JavaScript. Разработчиком языка TypeScript является Андерс Хейлсберг, создавший ранее Turbo Pascal, Delphi и C#.",
  },
  {
    id: 5,
    img: "/nodejs.svg",
    name: "Node или NodeJS",
    desc: " программная платформа, основанная на движке V8, превращающая JavaScript из узкоспециализированного языка в язык общего назначения.",
  },
  {
    id: 6,
    img: "/express.svg",
    name: "Express JS",
    desc: " фреймворк web-приложений для Node.js, реализованный как свободное и открытое программное обеспечение под лицензией MIT. Он спроектирован для создания веб-приложений и API. Де-факто является стандартным каркасом для Node.js",
  },
  {
    id: 7,
    img: "/mongodb.svg",
    name: "Mongo DB",
    desc: "документоориентированная система управления базами данных, не требующая описания схемы таблиц. Считается одним из классических примеров NoSQL-систем, использует JSON-подобные документы и схему базы данных. Написана на языке C++.",
  },
  {
    id: 8,
    img: "/next.svg",
    name: "Next JS",
    desc: "открытый JavaScript фреймворк, созданный поверх React.js для создания веб-приложений, созданный компанией Vercel.",
  },
  {
    id: 9,
    img: "/NestJS.svg",
    name: "Nest JS",
    desc: "современный фреймворк для создания эффективных и масштабируемых серверных приложений на Node. js. Он сочетает в себе принципы объектно-ориентированного и функционального программирования, предоставляя разработчикам инструменты для создания высокопроизводительных приложений.",
  },
  {
    id: 10,
    img: "/Postgresql.svg",
    name: "Postgre SQL",
    desc: "высокопроизводительная и надёжная объектно-реляционная система управления базами данных (ОРСУБД) с открытым исходным кодом, которая поддерживает широкий набор функций, стандарты SQL, различные типы данных, включая неструктурированные, и отличается расширяемостью и стабильностью. ",
  },
  {
    id: 11,
    img: "/docker.svg",
    name: "Docker",
    desc: "программная платформа и среда выполнения для создания, развертывания и управления приложениями с помощью контейнеров. Он позволяет «упаковать» приложение со всем его окружением и зависимостями в стандартизованный блок — контейнер, который может работать одинаково в любой среде.",
  },
];
